# import csv

# with open('city.csv', 'r', encoding='cp1251') as f:
#     fields = ['city', 'population']
#     reader = csv.DictReader(f, fields, delimiter=';')
    
#     city_list = []
#     for row in reader:
#         city_list.append(row['city'])
#     print(city_list)

city_list = ['Абака', 'Альметьевс', 'Ангарс', 'Арзама', 'Армави', 'Арте', 'Архангельс', 'Астрахан', 'Ачинс', 'Балаков', 'Балаших', 'Барнау', 'Батайс', 'Белгоро', 'Бердс', 'Березник', 'Бийс', 'Благовещенс', 'Братс', 'Брянс', 'Великий Новгоро', 'Владивосто', 'Владикавка', 'Владими', 'Волгогра', 'Волгодонс', 'Волжски', 'Вологд', 'Вороне', 'Грозны', 'Дербен', 'Дзержинс', 'Димитровгра', 'Долгопрудны', 'Домодедов', 'Евпатори', 'Екатеринбур', 'Еле', 'Ессентук', 'Железногорс', 'Жуковски', 'Златоус', 'Иванов', 'Ижевс', 'Иркутс', 'Йошкар-Ол', 'Казан', 'Калинингра', 'Калуг', 'Каменск - Уральски', 'Камыши', 'Каспийс', 'Кемеров', 'Керч', 'Киро', 'Кисловодс', 'Ковро', 'Коломн', 'Комсомольск-на-Амур', 'Копейс', 'Королё', 'Костром', 'Красногорс', 'Краснода', 'Красноярс', 'Курга', 'Курс', 'Кызы', 'Липец', 'Люберц', 'Магнитогорс', 'Майко', 'Махачкал', 'Миас', 'Москв', 'Мурманс', 'Муро', 'Мытищ', 'Набережные Челн', 'Назран', 'Нальчи', 'Находк', 'Невинномысс', 'Нефтекамс', 'Нефтеюганс', 'Нижневартовс', 'Нижнекамс', 'Нижний Новгоро', 'Нижний Таги', 'Новокузнец', 'Новокуйбышевс', 'Новомосковс', 'Новороссийс', 'Новосибирс', 'Новочебоксарс', 'Новочеркасс', 'Новошахтинс', 'Новый Уренго', 'Ногинс', 'Норильс', 'Ноябрьс', 'Обнинс', 'Одинцов', 'Октябрьски', 'Омс', 'Орё', 'Оренбур', 'Орехово-Зуев', 'Орс', 'Пенз', 'Первоуральс', 'Перм', 'Петрозаводс', 'Петропавловск-Камчатски', 'Подольс', 'Прокопьевс', 'Пско', 'Пушкин', 'Пятигорс', 'Раменско', 'Ростов-на-Дон', 'Рубцовс', 'Рыбинс', 'Рязан', 'Салава', 'Самар', 'Санкт-Петербур', 'Питер', 'Петербур', 'Саранс', 'Сарато', 'Севастопол', 'Северодвинс', 'Северс', 'Сергиев Поса', 'Серпухо', 'Симферопол', 'Смоленс', 'Соч', 'Ставропол', 'Старый Оско', 'Стерлитама', 'Сургу', 'Сызран', 'Сыктывка', 'Таганро', 'Тамбо', 'Твер', 'Тольятт', 'Томс', 'Тул', 'Тюмен', 'Улан - Уд', 'Ульяновс', 'Уссурийс', 'Уф', 'Хабаровс', 'Хасавюр', 'Химк', 'Чебоксар', 'Челябинс', 'Черепов', 'Черкесс', 'Чит', 'Шахт', 'Щёлков', 'Электростал', 'Элист', 'Энгель', 'Южно-Сахалинс', 'Якутс', 'Ярославл']
print(city_list)